# language:ru
Функционал: Тестирование поиска Google

  @smokeTest
  Сценарий: Просмотр результатов поиска
    Когда открывается страница "Стартовая страница"
    * пользователь (заполняет поле) "Логин" "avtotestovitch@yandex.ru"
    * пользователь (заполняет поле) "Пароль" "qwertyqwerty"
    И пользователь (нажимает кнопку) "Войти"
    Тогда открывается страница "Яндекс почта"
    Тогда пользователь открывает письмо от "hello@yandex.ru" с темой "Соберите всю почту в этот ящик"
    Когда открывается страница "Письмо"
    И пользователь проверет текст "hello@yandex.ru" на элементе "Отправитель"
    И пользователь проверет текст "Соберите всю почту в этот ящик" на элементе "Тема"
    И пользователь проверет что текст "Читайте и храните письма" содержится на элементе "Содержание письма"
    И пользователь (нажимает кнопку) "Иконка профиля"
    И пользователь (нажимает кнопку) "Выход"