# language:ru
Функционал: Тестирование почты Yandex

  @smokeTest
  Структура сценария: Просмотр результатов поиска
    Когда открывается страница "Стартовая страница"
    * пользователь (заполняет поле) "Логин" "avtotestovitch@yandex.ru"
    * пользователь (заполняет поле) "Пароль" "qwertyqwerty"
    И пользователь (нажимает кнопку) "Войти"
    Тогда открывается страница "Яндекс почта"
    И пользователь проверет текст "avtotestovitch" на элементе "Имя профиля"
    Тогда пользователь открывает письмо от "<messageFrom>" с темой "<textSubject>"
    Когда открывается страница "Письмо"
    И пользователь проверет текст "<messageFrom>" на элементе "Отправитель"
    И пользователь проверет текст "<textSubject>" на элементе "Тема"
    И пользователь проверет что текст "<textBody>" содержится на элементе "Содержание письма"
    И пользователь (нажимает кнопку) "Иконка профиля"
    И пользователь (нажимает кнопку) "Выход"
    Тогда открывается страница "Стартовая страница"
    Тогда пользователь проверет текст "" на элементе "Логин"

    Примеры:
      | messageFrom          | textSubject                    | textBody                         |
      | hello@yandex.ru      | Соберите всю почту в этот ящик | Читайте и храните письма         |
      | hello@yandex-team.ru | Как читать почту с мобильного  | Добро пожаловать в Яндекс.Почту! |